Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The `quarkus-google-cloud-functions` extension allows you to use Quarkus to build your Google Cloud Functions. Your functions can use injection annotations from CDI or Spring and other Quarkus facilities as you need them.
ja_jp: `quarkus-google-cloud-functions` エクステンションを使用すると、Quarkusを使用してGoogle Cloud Functionsを構築することができます。関数では、CDIやSpringからのインジェクションアノテーションや、必要に応じて他のQuarkusの機能を使用できます。

source: The `quarkus-google-cloud-functions` extension scans your project for a class that directly implements the Google Cloud `HttpFunction`, `BackgroundFunction` or `RawBackgroundFunction` interface. It must find a class in your project that implements one of these interfaces or it will throw a build time failure. If it finds more than one function classes, a build time exception will also be thrown.
ja_jp: `quarkus-google-cloud-functions` エクステンションは、プロジェクト内からGoogle Cloud `HttpFunction` 、 `BackgroundFunction` 、または `RawBackgroundFunction` インターフェイスを直接実装しているクラスをプロジェクト内でスキャンします。これらのインターフェイスを実装しているクラスがプロジェクト内で見つからない場合やインターフェイスを実装しているクラスが複数見つかった場合は、ビルド時に例外がスローされます。

source: The `quarkus-google-cloud-functions` extension scans your project for a class that directly implements the Google Cloud `HttpFunction`, `BackgroundFunction`, `RawBackgroundFunction` or `CloudEventsFunction` interface. It must find a class in your project that implements one of these interfaces, or it will throw a build time failure. If it finds more than one function classes, a build time exception will also be thrown.
ja_jp: `quarkus-google-cloud-functions` エクステンションは、プロジェクト内からGoogle Cloud `HttpFunction` 、 `BackgroundFunction` 、または `RawBackgroundFunction` 、 `CloudEventsFunction` インターフェイスを直接実装しているクラスをプロジェクト内でスキャンします。プロジェクト内でこれらのインターフェイスを実装しているクラスが見つからなければ、ビルド時にエラーがスローされます。 複数の関数クラスが見つかった場合は、ビルド時の例外がスローされます。

source: The `quarkus-hibernate-orm` extension will run the `import.sql` script in `src/main/resources` when Quarkus is running in dev mode. More details can be found in the xref:hibernate-orm.adoc#dev-mode[Hibernate ORM guide].
ja_jp: `quarkus-hibernate-orm` エクステンションは、Quarkus が開発モードで実行されている場合、`src/main/resources` にある `import.sql` スクリプトを実行します。詳細は xref:hibernate-orm.adoc#dev-mode[Hibernate ORM ガイド] を参照してください。

source: The `quarkus-hibernate-orm` extension will run the `import.sql` script in `src/main/resources` when Quarkus is running in dev mode. More details can be found xref:hibernate-orm.adoc#dev-mode[here].
ja_jp: `quarkus-hibernate-orm` エクステンションは、Quarkus が開発モードで動作しているときに、 `import.sql` スクリプトを `src/main/resources` で実行します。詳細は link:hibernate-orm.html#dev-mode[こちら] をご覧ください。

source: The `quarkus-hibernate-orm` extension will run the `import.sql` script in `src/main/resources` when Quarkus is running in dev-mode. More details can be found xref:hibernate-orm.adoc#dev-mode[here].
ja_jp: `quarkus-hibernate-orm` エクステンションは、Quarkusがdev-modeで動作しているときに、 `import.sql` スクリプトを `src/main/resources` で実行します。詳細は link:hibernate-orm.html#dev-mode[こちら]をご覧ください。

source: The `quarkus-keycloak-authorization` extension centralizes authorization responsibilities in Keycloak, enhancing security and simplifying application maintenance:
ja_jp: `quarkus-keycloak-authorization` エクステンションは、Keycloak の認可責任を一元化し、セキュリティーを強化して、アプリケーションのメンテナンスを簡素化します。

source: The `quarkus-keycloak-authorization` extension is based on `quarkus-oidc` and provides a policy enforcer that enforces access to protected resources based on permissions managed by Keycloak and currently can only be used with the Quarkus xref:security-openid-connect.adoc[OIDC service applications]. It provides a flexible and dynamic authorization capability based on Resource-Based Access Control. In other words, instead of explicitly enforcing access based on some specific access control mechanism (e.g.: RBAC), you just check whether a request is allowed to access a resource based on its name, identifier or URI.
ja_jp: `quarkus-keycloak-authorization` エクステンションは、 `quarkus-oidc` に基づいており、Keycloakによって管理される権限に基づいて保護されたリソースへのアクセスを強制するポリシーエンフォーサーを提供しており、現在はQuarkus link:security-openid-connect.html[OIDCサービスアプリケーション]でのみ使用することができます。Keycloakは、リソースベースアクセスコントロールに基づいた、柔軟で動的な認可機能を提供します。つまり、特定のアクセス制御メカニズム（RBACなど）に基づいて明示的にアクセスを強制するのではなく、リソースの名前、識別子、またはURIに基づいて、リクエストがリソースへのアクセスを許可されているかどうかをチェックするだけで済むようになります。

source: The `quarkus-keycloak-authorization` extension is based on `quarkus-oidc` and provides a policy enforcer that enforces access to protected resources based on permissions managed by Keycloak and currently can only be used with the Quarkus xref:security-openid-connect.adoc[OIDC service applications]. It provides a flexible and dynamic authorization capability based on Resource-Based Access Control. In other words, instead of explicitly enforcing access based on some specific access control mechanism (e.g.: RBAC), you just check whether or not a request is allowed to access a resource based on its name, identifier or URI.
ja_jp: `quarkus-keycloak-authorization` エクステンションは、 `quarkus-oidc` に基づいており、Keycloakによって管理されるアクセス許可に基づいて、保護されたリソースへのアクセスを強制するポリシーエンフォーサーを提供します。現在、Quarkus xref:security-openid-connect.adoc[OIDC サービスアプリケーション] でのみ使用できます。 リソースベースのアクセス制御に基づいて、柔軟で動的な権限付与機能を提供します。 つまり、特定のアクセス制御メカニズム（例：RBAC）に基づいて明示的にアクセスを強制する代わりに、リクエストの名前、識別子、URIに基づいてリソースへのアクセスが許可されているかどうかをチェックするだけです。

source: The `quarkus-kogito-bom` import is now reported as 'unnecessary' since none of the Quarkus extensions it includes are found among the project dependencies
ja_jp: `quarkus-kogito-bom` のインポートに含まれる Quarkus エクステンションは、どれもプロジェクトの依存関係で見つからないため、このインポートは '不要' と報告されるようになりました。

source: The `quarkus-kotlin` artifact is added to the dependencies. This artifact provides support for Kotlin in the live reload mode (more about this later on)
ja_jp: `quarkus-kotlin` アーティファクトが依存関係に追加されています。このアーティファクトはライブリロードモードでの Kotlin のサポートを提供します (これについては後ほど説明します)。

source: The `quarkus-kubernetes-service-binding` extension can generate the `ServiceBinding` resource automatically after detecting that an application requires access to the external services that are provided by available bindable Operators.
ja_jp: `quarkus-kubernetes-service-binding` エクステンションは、アプリケーションが利用可能でバインド可能な Operator によって提供される外部サービスへのアクセスを必要とすることを検出した後、自動的に `ServiceBinding` リソースを生成することができます。

source: The `quarkus-kubernetes-service-binding` extension provides a more compact way of expressing the same information. For example:
ja_jp: `quarkus-kubernetes-service-binding` エクステンションは、同じ情報をよりコンパクトに表現する方法を提供します。以下に例を示します。

source: The `quarkus-logging-gelf` extension will add a GELF log handler to the underlying logging backend that Quarkus uses (jboss-logmanager). By default, it is disabled, if you enable it but still use another handler (by default the console handler is enabled), your logs will be sent to both handlers.
ja_jp: `quarkus-logging-gelf` エクステンションは、Quarkusが使用する基礎となるロギングバックエンド(jboss-logmanager)にGELFログハンドラーを追加します。デフォルトでは無効になっており、有効にした場合も別のハンドラーも使用している場合(デフォルトではコンソールハンドラーが有効になっています)、ログは両方のハンドラーに送信されます。

source: The `quarkus-logging-json` extension may be employed to add support for the JSON logging format and its related configuration.
ja_jp: `quarkus-logging-json` エクステンションは、JSONロギングフォーマットとそれに関連する設定のサポートを追加するために使われます。

source: The `quarkus-logging-json` extension might be employed to add support for the JSON logging format and its related configuration.
ja_jp: `quarkus-logging-json` エクステンションを使用すると、JSON ロギングフォーマットとその関連設定のサポートを追加できます。

source: The `quarkus-mailer` extension will enable an in-memory mock mail server when Quarkus is running in dev mode. See the xref:mailer-reference.adoc#testing[Mailer guide] for more details.
ja_jp: `quarkus-mailer` エクステンションは、Quarkus が開発モードで実行されている場合に、インメモリのモックメールサーバーを有効にします。詳細は xref:mailer-reference.adoc#testing[Mailer ガイド] を参照してください。

source: The `quarkus-mailer` extension will enable an in-memory mock mail server when Quarkus is running in dev mode. See xref:mailer-reference.adoc#testing[this] for more details.
ja_jp: `quarkus-mailer` エクステンションは、Quarkus が開発モードで動作しているときに、インメモリのモックメールサーバを有効にします。詳しくは link:mailer-reference.html#testing[こちら] をご覧ください。

source: The `quarkus-mailer` extension will enable an in-memory mock mail server when Quarkus is running in dev-mode. See xref:mailer-reference.adoc#testing[this] for more details.
ja_jp: `quarkus-mailer` エクステンションは、Quarkusがdev-modeで動作しているときに、インメモリのモックメールサーバを有効にします。詳しくは link:mailer-reference.html#testing[こちら]をご覧ください。

source: The `quarkus-micrometer` extension and the `quarkus-smallrye-metrics` extension provide support for collecting metrics. As a compatibility note, the `quarkus-micrometer` extension adapts the MP Metrics API to Micrometer library primitives, so the `quarkus-micrometer` extension can be enabled without breaking code that relies on the MP Metrics API. Note that the metrics emitted by Micrometer are different, see the `quarkus-micrometer` extension documentation for more information.
ja_jp: `quarkus-micrometer` エクステンションと `quarkus-smallrye-metrics` エクステンションは、メトリクスを収集するためのサポートを提供します。互換性についての注意点として、 `quarkus-micrometer` エクステンションは MP Metrics API を Micrometer ライブラリのプリミティブに適応させているので、MP Metrics API に依存しているコードを壊すことなく `quarkus-micrometer` エクステンションを有効にすることができます。Micrometer が出力するメトリクスは異なることに注意してください。詳細は `quarkus-micrometer` エクステンションのドキュメントを参照してください。

source: The `quarkus-micrometer` extension provide support for collecting metrics. As a compatibility note, the `quarkus-micrometer` extension adapts the MP Metrics API to Micrometer library primitives, so the `quarkus-micrometer` extension can be enabled without breaking code that relies on the MP Metrics API. Note that the metrics emitted by Micrometer are different, see the `quarkus-micrometer` extension documentation for more information.
ja_jp: `quarkus-micrometer` エクステンションはメトリクスの収集をサポートします。互換性に関する注意として、 `quarkus-micrometer` エクステンションは MP Metrics API を Micrometer ライブラリーのプリミティブに適合させるため、 MP Metrics API に依存するコードを壊すことなく `quarkus-micrometer` エクステンションを有効にできます。 Micrometer によって出力されるメトリクスは異なることに注意してください。詳細については `quarkus-micrometer` エクステンションのドキュメントを参照してください。

source: The `quarkus-narayana-jta` extension provides a Transaction Manager that coordinates and expose transactions to your applications as described in the link: https://jakarta.ee/specifications/transactions/[Jakarta Transactions] specification, formerly known as Java Transaction API (JTA).
ja_jp: `quarkus-narayana-jta` エクステンションは、リンク先 link:https://jakarta.ee/specifications/transactions/[Jakarta Transactions] 仕様（旧称 Java Transaction API (JTA)）で説明されているように、トランザクションを調停し、アプリケーションに公開するトランザクション・マネージャを提供します 。

source: The `quarkus-oidc-client-filter` extension requires the `quarkus-oidc-client` extension and provides JAX-RS `OidcClientRequestFilter`, which sets the access token acquired by `OidcClient` as the `Bearer` scheme value of the HTTP `Authorization` header. This filter can be registered with MP RestClient implementations injected into the current Quarkus endpoint, but it is not related to the authentication requirements of this service endpoint. For example, it can be a public endpoint, or it can be protected with mTLS.
ja_jp: `quarkus-oidc-client-filter` エクステンションは、 `quarkus-oidc-client` エクステンションを必要とし、JAX-RS `OidcClientRequestFilter` を提供します。これは、 `OidcClient` で取得したアクセストークンを HTTP `Authorization` ヘッダの `Bearer` スキーム値として設定するものです。このフィルタは、現在のQuarkusエンドポイントに注入されるMP RestClient実装に登録できますが、このサービスエンドポイントの認証要件には関係しません。たとえば、公開エンドポイントにすることも、mTLSで保護することもできます。

source: The `quarkus-oidc-client-graphql` extension provides a way to integrate an OIDC client into xref:smallrye-graphql-client.adoc[GraphQL clients] paralleling the approach used with REST clients. When this extension is active, any GraphQL client configured through properties (rather than programmatically by the builder) will use the OIDC client to acquire an access token, which it will then set as the `Authorization` header value. The OIDC client will also refresh expired access tokens.
ja_jp: `quarkus-oidc-client-graphql` エクステンションは、REST クライアントで使用されるアプローチと並行して、OIDC クライアントを xref:smallrye-graphql-client.adoc[GraphQL クライアント] に統合する方法を提供します。 このエクステンションがアクティブな場合、プロパティーを通じて設定された GraphQL クライアント (ビルダーによってプログラム的にではなく) は OIDC クライアントを使用してアクセストークンを取得して `Authorization` ヘッダー値として設定します。 この OIDC クライアントは期限切れのアクセストークンも更新します。

source: The `quarkus-oidc-client-graphql` extension provides a way to integrate an OIDC client into xref:smallrye-graphql-client.adoc[GraphQL clients], paralleling the approach used with REST clients.
ja_jp: `quarkus-oidc-client-graphql` エクステンションは、REST クライアントで使用されるアプローチと並行して、OIDC クライアントを xref:smallrye-graphql-client.adoc[GraphQL クライアント] に統合する方法を提供します。

source: The `quarkus-oidc-client-registration` extension allows register one or more clients using OIDC client registration configurations, either on start-up or on demand, and read, update and delete metadata of the registered clients.
ja_jp: `quarkus-oidc-client-registration` エクステンションを使用すると、起動時または必要に応じて OIDC クライアント登録設定を使用して 1 つ以上のクライアントを登録し、登録されたクライアントのメタデータを読み取り、更新、削除できます。

source: The `quarkus-oidc-client` extension provides `OidcClient` for acquiring and refreshing access tokens from OpenID Connect and OAuth2 providers that support the following token grants:
ja_jp: `quarkus-oidc-client` エクステンションは、以下のトークングラントをサポートする OpenID Connect および OAuth2 プロバイダーからアクセストークンを取得し、リフレッシュするための `OidcClient` を提供します。

source: The `quarkus-oidc-client` extension provides `OidcClient` for acquiring and refreshing access tokens from OpenID Connect and OAuth2 providers that support the following token grants: * `client-credentials` * `password` * `refresh_token`
ja_jp: `quarkus-oidc-client` エクステンションは、以下のトークングラントをサポートする OpenID Connect および OAuth2 プロバイダからアクセストークンを取得し、リフレッシュするための `OidcClient` を提供します： * `client-credentials` * `password` * `refresh_token`

source: The `quarkus-oidc-client` extension provides a reactive `io.quarkus.oidc.client.OidcClient`, which can be used to acquire and refresh tokens by using SmallRye Mutiny `Uni` and `Vert.x WebClient`.
ja_jp: `quarkus-oidc-client` エクステンションは、SmallRye Mutiny `Uni` と `Vert.x WebClient` を使用してトークンを取得および更新するために使用できる、リアクティブな `io.quarkus.oidc.client.OidcClient` を提供します。

source: The `quarkus-oidc-client` extension provides a reactive `io.quarkus.oidc.client.OidcClient`, which can be used to acquire and refresh tokens using SmallRye Mutiny `Uni` and `Vert.x WebClient`.
ja_jp: `quarkus-oidc-client` エクステンションは、SmallRye Mutiny `Uni` および `Vert.xWebClient` を使用してトークンを取得および更新するために使用できるリアクティブな `io.quarkus.oidc.client.OidcClient` を提供します。

source: The `quarkus-oidc-token-propagation-reactive` extension (as opposed to the non-reactive `quarkus-oidc-token-propagation` extension) does not currently support the exchanging or resigning the tokens before the propagation. However these features may be added in the future.
ja_jp: (リアクティブではない `quarkus-oidc-token-propagation` エクステンションとは対照的に) `quarkus-oidc-token-propagation-reactive` エクステンションは現在、伝播前のトークンの交換または再署名をサポートしていません。ただし、これらの機能は将来追加される可能性があります。

source: The `quarkus-oidc-token-propagation-reactive` extension (as opposed to the non-reactive `quarkus-oidc-token-propagation` extension) does not currently support the exchanging or resigning the tokens before the propagation. However, these features may be added in the future.
ja_jp: (非リアクティブの `quarkus-oidc-token-propagation` エクステンションとは対照的に) `quarkus-oidc-token-propagation-reactive` エクステンションは現在、伝播の前にトークンを交換したり放棄することをサポートしていません。しかし、これらの機能は将来的に追加される可能性があります。

source: The `quarkus-oidc-token-propagation-reactive` extension provides `io.quarkus.oidc.token.propagation.reactive.AccessTokenRequestReactiveFilter` which can be used to propagate the current `Bearer` or `Authorization Code Flow` access tokens.
ja_jp: `quarkus-oidc-token-propagation-reactive` エクステンションは、 `io.quarkus.oidc.token.propagation.reactive.AccessTokenRequestReactiveFilter` を提供します。これは、現在の `Bearer` または `Authorization Code Flow` アクセストークンを伝播するために使用することができます。

source: The `quarkus-oidc-token-propagation` extension provides two JAX-RS `javax.ws.rs.client.ClientRequestFilter` class implementations that simplify the propagation of authentication information. `io.quarkus.oidc.token.propagation.AccessTokenRequestFilter` propagates the xref:security-openid-connect.adoc[Bearer] token present in the current active request or the token acquired from the xref:security-openid-connect-web-authentication.adoc[Authorization Code Flow], as the HTTP `Authorization` header's `Bearer` scheme value. The `io.quarkus.oidc.token.propagation.JsonWebTokenRequestFilter` provides the same functionality, but in addition provides support for JWT tokens.
ja_jp: `quarkus-oidc-token-propagation` エクステンションは、認証情報の伝搬を簡素化する 2 つの JAX-RS `javax.ws.rs.client.ClientRequestFilter` クラスの実装を提供します。 `io.quarkus.oidc.token.propagation.AccessTokenRequestFilter` は、現在のアクティブなリクエストに存在する xref:security-openid-connect.adoc[Bearer] トークン、または HTTP `Authorization` ヘッダーの `Bearer` スキーム値として xref:security-openid-connect-web-authentication.adoc[Authorization Code Flow] から取得したトークンを伝播させます。 `io.quarkus.oidc.token.propagation.JsonWebTokenRequestFilter` は同じ機能を提供しますが、これに加えて JWT トークンのサポートも提供します。

source: The `quarkus-oidc-token-propagation` extension requires the `quarkus-oidc` extension and provides JAX-RS `TokenCredentialRequestFilter`, which sets the OpenID Connect Bearer or Authorization Code Flow access token as the `Bearer` scheme value of the HTTP `Authorization` header. This filter can be registered with MP RestClient implementations injected into the current Quarkus endpoint, which in turn must be protected by using the Quarkus OpenID Connect adapter. This filter can be used to propagate the access token to the downstream services.
ja_jp: `quarkus-oidc-client-filter` エクステンションは、 `quarkus-oidc-client` エクステンションを必要とし、JAX-RS `OidcClientRequestFilter` を提供します。これは、OpenID Connect ベアラーまたは 認可コードフローアクセス トークンを HTTP `Authorization` ヘッダーの `Bearer` スキーム値として設定します。このフィルターは、現在の Quarkus エンドポイントに挿入された MP RestClient 実装に登録できます。これは、Quarkus OpenID Connect アダプターを使用して保護する必要があります。 このフィルターを使用して、アクセス トークンを下流のサービスに伝搬できます。

source: The `quarkus-oidc` extension is used to protect the secured endpoint and manage the GitHub OAuth2 authentication. The `quarkus-rest` extension is used to support JAX-RS REST endpoints, while the `quarkus-rest-qute` extension makes it easier to render Qute templates with JAX-RS.
ja_jp: `quarkus-oidc` エクステンションは、保護されたエンドポイントのセキュリティーを確保し、GitHub OAuth2 認証を管理するために使用されます。 `quarkus-rest` エクステンションは JAX-RS REST エンドポイントをサポートするために使用され、 `quarkus-rest-qute` エクステンションは JAX-RS で Qute テンプレートをレンダリングしやすくします。

source: The `quarkus-oidc` extension represents a registered OIDC application client. This client needs to authenticate to the OIDC provider when acquiring, introspecting or revoking tokens.
ja_jp: `quarkus-oidc` エクステンションは、登録された OIDC アプリケーションクライアントを表します。 このクライアントは、トークンの取得、イントロスペクション、または失効を行う際に、 OIDC プロバイダーに対して認証を行う必要があります。

source: The `quarkus-opentelemetry` extension can be added to your build file like this:
ja_jp: `quarkus-opentelemetry` エクステンションは、次のようにビルドファイルに追加できます。

source: The `quarkus-rest-client-oidc-token-propagation` extension provides a REST Client filter, `io.quarkus.oidc.token.propagation.reactive.AccessTokenRequestReactiveFilter`, that simplifies the propagation of authentication information.
ja_jp: `quarkus-rest-client-oidc-token-propagation` エクステンションは、認証情報の伝播を簡素化する REST クライアントフィルター `io.quarkus.oidc.token.propagation.reactive.AccessTokenRequestReactiveFilter` を提供します。

source: The `quarkus-rest-client-oidc-token-propagation` extension provides a REST Client filter, `io.quarkus.oidc.token.propagation.reactive.AccessTokenRequestReactiveFilter`, that simplifies the propagation of authentication information. This client propagates the xref:security-oidc-bearer-token-authentication.adoc[bearer token] present in the currently active request or the token acquired from the xref:security-oidc-code-flow-authentication.adoc[authorization code flow mechanism] as the HTTP `Authorization` header's `Bearer` scheme value.
ja_jp: `quarkus-rest-client-oidc-token-propagation` エクステンションは、認証情報の伝播を簡素化する REST クライアントフィルター `io.quarkus.oidc.token.propagation.reactive.AccessTokenRequestReactiveFilter` を提供します。このクライアントは、現在アクティブなリクエストに存在する xref:security-oidc-bearer-token-authentication.adoc[ベアラートークン]、または xref:security-oidc-code-flow-authentication.adoc[認可コードフローメカニズム] から取得したトークンを、HTTP `Authorization` ヘッダーの `Bearer` スキーム値として伝播します。

source: The `quarkus-rest-client-oidc-token-propagation` extension supports an easy access token propagation with the REST client, and the `quarkus-rest-client-jackson` helps to convert REST client responses in JSON format to Java beans and records with Jackson.
ja_jp: `quarkus-rest-client-oidc-token-propagation` エクステンションは REST クライアントによる簡単なアクセストークンの伝播をサポートし、 `quarkus-rest-client-jackson` は Jackson を使用して JSON 形式の REST クライアントレスポンスを Java Bean やレコードに変換するのを助けます。

source: The `quarkus-resteasy-client-oidc-filter` extension requires the `quarkus-oidc-client` extension. It provides JAX-RS RESTful Web Services `OidcClientRequestFilter`, which sets the access token acquired by `OidcClient` as the `Bearer` scheme value of the HTTP `Authorization` header. This filter can be registered with MicroProfile REST client implementations injected into the current Quarkus endpoint, but it is not related to the authentication requirements of this service endpoint. For example, it can be a public endpoint or be protected with mTLS.
ja_jp: `quarkus-resteasy-client-oidc-filter` エクステンションには `quarkus-oidc-client` エクステンションが必要です。 これは、 `OidcClient` によって取得されたアクセストークンを HTTP `Authorization` ヘッダーの `Bearer` スキーム値として設定する JAX-RS RESTful Web サービス `OidcClientRequestFilter` を提供します。 このフィルターは、現在の Quarkus エンドポイントに注入された MicroProfile REST クライアント実装に登録できますが、このサービスエンドポイントの認証要件とは関係ありません。 たとえば、パブリックエンドポイントにしたり、mTLS で保護したりできます。

source: The `quarkus-resteasy-client-oidc-token-propagation` extension provides two Jakarta REST `jakarta.ws.rs.client.ClientRequestFilter` class implementations that simplify the propagation of authentication information. `io.quarkus.oidc.token.propagation.AccessTokenRequestFilter` propagates the xref:security-oidc-bearer-token-authentication.adoc[Bearer token] present in the current active request or the token acquired from the xref:security-oidc-code-flow-authentication.adoc[Authorization code flow mechanism], as the HTTP `Authorization` header's `Bearer` scheme value.
ja_jp: `quarkus-resteasy-client-oidc-token-propagation` エクステンションは、認証情報の伝播を簡素化する 2 つの Jakarta REST `jakarta.ws.rs.client.ClientRequestFilter` クラス実装を提供します。`io.quarkus.oidc.token.propagation.AccessTokenRequestFilter` は、HTTP `Authorization` ヘッダーの `Bearer` スキーム値として、現在アクティブなリクエストに存在する xref:security-oidc-bearer-token-authentication.adoc[ベアラートークン] または xref:security-oidc-code-flow-authentication.adoc[認可コードフローメカニズム] から取得したトークンを伝播します。
